In [1]:
import sqlalchemy
%load_ext sql
%sql oracle://scott:tiger@localhost:1521/orcl

# 여러 테이블의 데이터를 조인해서 출력하기 (EQUL JOIN)
"조인을 이용하면 두 개 이상의 테이블들의 컬럼들을 하나의 결과로 모아서 볼수 가 있다."  
ex) 이름, 부서위치를 출력하시오

In [2]:
%%sql

select ename, loc
    from emp, dept

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', 'NEW YORK'),
 ('BLAKE', 'NEW YORK'),
 ('CLARK', 'NEW YORK'),
 ('JONES', 'NEW YORK'),
 ('MARTIN', 'NEW YORK'),
 ('ALLEN', 'NEW YORK'),
 ('TURNER', 'NEW YORK'),
 ('JAMES', 'NEW YORK'),
 ('WARD', 'NEW YORK'),
 ('FORD', 'NEW YORK'),
 ('SMITH', 'NEW YORK'),
 ('SCOTT', 'NEW YORK'),
 ('ADAMS', 'NEW YORK'),
 ('MILLER', 'NEW YORK'),
 ('KING', 'DALLAS'),
 ('BLAKE', 'DALLAS'),
 ('CLARK', 'DALLAS'),
 ('JONES', 'DALLAS'),
 ('MARTIN', 'DALLAS'),
 ('ALLEN', 'DALLAS'),
 ('TURNER', 'DALLAS'),
 ('JAMES', 'DALLAS'),
 ('WARD', 'DALLAS'),
 ('FORD', 'DALLAS'),
 ('SMITH', 'DALLAS'),
 ('SCOTT', 'DALLAS'),
 ('ADAMS', 'DALLAS'),
 ('MILLER', 'DALLAS'),
 ('KING', 'CHICAGO'),
 ('BLAKE', 'CHICAGO'),
 ('CLARK', 'CHICAGO'),
 ('JONES', 'CHICAGO'),
 ('MARTIN', 'CHICAGO'),
 ('ALLEN', 'CHICAGO'),
 ('TURNER', 'CHICAGO'),
 ('JAMES', 'CHICAGO'),
 ('WARD', 'CHICAGO'),
 ('FORD', 'CHICAGO'),
 ('SMITH', 'CHICAGO'),
 ('SCOTT', 'CHICAGO'),
 ('ADAMS', 'CHICAGO'),
 ('MILLER', 'CHICAGO'),
 ('KING', 'BOSTON'),
 ('BLAKE', 'BOSTON'),
 ('CLARK', 'BOSTON'),
 ('JONES', 'BOSTON'),
 ('MARTIN', 'BOSTON'),
 ('ALLEN', 'BOSTON'),
 ('TURNER', 'BOSTON'),
 ('JAMES', 'BOSTON'),
 ('WARD', 'BOSTON'),
 ('FORD', 'BOSTON'),
 ('SMITH', 'BOSTON'),
 ('SCOTT', 'BOSTON'),
 ('ADAMS', 'BOSTON'),
 ('MILLER', 'BOSTON')]

14 x 4건 =56건이 되어서 다 조인되었음  
king이 new york에도 근무하고 dallas, chicago, boston에도 근무하는 꼴

In [3]:
%%sql

select ename, loc
    from emp, dept
    where emp.deptno = dept.deptno

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', 'NEW YORK'),
 ('BLAKE', 'CHICAGO'),
 ('CLARK', 'NEW YORK'),
 ('JONES', 'DALLAS'),
 ('MARTIN', 'CHICAGO'),
 ('ALLEN', 'CHICAGO'),
 ('TURNER', 'CHICAGO'),
 ('JAMES', 'CHICAGO'),
 ('WARD', 'CHICAGO'),
 ('FORD', 'DALLAS'),
 ('SMITH', 'DALLAS'),
 ('SCOTT', 'DALLAS'),
 ('ADAMS', 'DALLAS'),
 ('MILLER', 'NEW YORK')]

조인 조건을 where 절에 기술해야 정확한 결과를 볼수 있음  
조인 조건을 줘야 조인을 할 수 있다.  
emp 테이블의 deptno는 dept 테이블에 deptno와 같다라고 오라클에게 알려주면서  
이 컬럼으로 두 개의 테이블을 서로 조인(join)하는 것

<br>

문제 210. 직업이 SALESMAN인 사원들의 이름과 월급과 직업과 부서위치를 출력하시오

In [4]:
%%sql

select ename, sal, job, loc
    from emp e, dept d
    where e.deptno = d.deptno 
          and e.job = 'SALESMAN'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('MARTIN', Decimal('1250'), 'SALESMAN', 'CHICAGO'),
 ('ALLEN', Decimal('1600'), 'SALESMAN', 'CHICAGO'),
 ('TURNER', Decimal('1500'), 'SALESMAN', 'CHICAGO'),
 ('WARD', Decimal('1250'), 'SALESMAN', 'CHICAGO')]

문제 211. 월급이 2000 이상인 사원들의 이름과 월급과 부서위치를 출력하시오

In [5]:
%%sql

select ename, sal, loc
    from emp e, dept d
    where e.deptno = d.deptno
          and sal >= 2000

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'), 'NEW YORK'),
 ('BLAKE', Decimal('2850'), 'CHICAGO'),
 ('CLARK', Decimal('2450'), 'NEW YORK'),
 ('JONES', Decimal('2975'), 'DALLAS'),
 ('FORD', Decimal('3000'), 'DALLAS'),
 ('SCOTT', Decimal('3000'), 'DALLAS')]

문제 212. 위의 결과에서 이름, 월급, 부서위치 옆에 부서번호도 같이 출력하시오

In [6]:
%%sql

select ename, sal, loc, d.deptno
    from emp e, dept d
    where e.deptno = d.deptno
          and sal >= 2000

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'), 'NEW YORK', 10),
 ('BLAKE', Decimal('2850'), 'CHICAGO', 30),
 ('CLARK', Decimal('2450'), 'NEW YORK', 10),
 ('JONES', Decimal('2975'), 'DALLAS', 20),
 ('FORD', Decimal('3000'), 'DALLAS', 20),
 ('SCOTT', Decimal('3000'), 'DALLAS', 20)]

첫째열을 select ename, sal, loc, deptno로 쓰면  
"1행의 오류: 열의 정의가 애매합니다"  
라는 오류가 뜬다  
이는 emp, dept 두 테이블 모두 deptno 컬럼이 존재하기 때문에 어느걸 출력해야 할지 애매하기 때문  

<br>

- 에러가 나지 않는다고 컬럼명 앞에 테이블 명을 적지 않는 습관을 지양하고 무조건 조인문장에서는 컬럼명 앞에 테이블 명을 적어준다.
    - 테이블.컬럼명으로 작성해줘야 검색 속도가 더 빨라짐
    - 테이블명을 붙여주지 않으면 오라클이 일일히 검색하기 때문
    
문제 213. 월급이 1000에서 3000 사이인 사원들의 이름과 월급과 부서위치를 출력하시오

In [7]:
%%sql

select e.ename, e.sal, d.loc
    from emp e, dept d
    where e.deptno = d.deptno
          and e.sal between 1000 and 3000

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('BLAKE', Decimal('2850'), 'CHICAGO'),
 ('CLARK', Decimal('2450'), 'NEW YORK'),
 ('JONES', Decimal('2975'), 'DALLAS'),
 ('MARTIN', Decimal('1250'), 'CHICAGO'),
 ('ALLEN', Decimal('1600'), 'CHICAGO'),
 ('TURNER', Decimal('1500'), 'CHICAGO'),
 ('WARD', Decimal('1250'), 'CHICAGO'),
 ('FORD', Decimal('3000'), 'DALLAS'),
 ('SCOTT', Decimal('3000'), 'DALLAS'),
 ('ADAMS', Decimal('1100'), 'DALLAS'),
 ('MILLER', Decimal('1300'), 'NEW YORK')]

문제 214. 사원번호가 7788, 7902, 7369번인 사원의 사원번호, 이름, 월급, 부서위치를 출력하시오

In [8]:
%%sql

select e.empno, e.ename, e.sal, d.loc
    from emp e, dept d
    where e.deptno = d.deptno
          and e.empno in (7788, 7902, 7369)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(7902, 'FORD', Decimal('3000'), 'DALLAS'),
 (7369, 'SMITH', Decimal('800'), 'DALLAS'),
 (7788, 'SCOTT', Decimal('3000'), 'DALLAS')]

문제 215. 이름의 첫번째 철자가 S로 시작하는 사원의 이름과 월급과 부서위치를 출력하시오

In [9]:
%%sql

select e.ename, e.sal, d.loc
    from emp e, dept d
    where d.deptno = e.deptno
          and e.ename like 'S%'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SMITH', Decimal('800'), 'DALLAS'), ('SCOTT', Decimal('3000'), 'DALLAS')]

문제 216. DALLAS 에서 근무하는 사원들의 이름, 직업, 부서위치를 출력하시오.

In [10]:
%%sql

select e.ename, e.job, d.loc
    from emp e, dept d
    where e.deptno = d.deptno
          and d.loc = 'DALLAS'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('JONES', 'MANAGER', 'DALLAS'),
 ('FORD', 'ANALYST', 'DALLAS'),
 ('SMITH', 'CLERK', 'DALLAS'),
 ('SCOTT', 'ANALYST', 'DALLAS'),
 ('ADAMS', 'CLERK', 'DALLAS')]

문제 217. 부서위치, 부서위치별 토탈월급을 출력하시오

In [11]:
%%sql

select d.loc, sum(e.sal)
    from emp e, dept d
    where e.deptno = d.deptno
    group by d.loc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('NEW YORK', 8750), ('DALLAS', 10875), ('CHICAGO', 9400)]

문제 218. 부서위치, 부서위치별 평균월급을 출력하는데 소수점 이하는 안나오게 반올림하고  
             부서위치별 평균월급이 높은 것 부터 출력하시오

In [12]:
%%sql

select d.loc, round(avg(e.sal), 0) as "avg(sal)"
    from dept d, emp e
    where d.deptno = e.deptno
    group by d.loc
    order by avg(sal) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('NEW YORK', 2917), ('DALLAS', 2175), ('CHICAGO', 1567)]

문제 219. 월급이 2700 이상인 이상인 사원들의 이름, 월급, 부서위치를 출력하시오

In [13]:
%%sql

select e.ename, e.sal, d.loc
    from emp e, dept d
    where e.deptno = d.deptno
          and e.sal >= 2700

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'), 'NEW YORK'),
 ('BLAKE', Decimal('2850'), 'CHICAGO'),
 ('JONES', Decimal('2975'), 'DALLAS'),
 ('FORD', Decimal('3000'), 'DALLAS'),
 ('SCOTT', Decimal('3000'), 'DALLAS')]

※ 지금은 테이블 명이 작아서 괜찮지만 현업에서는 테이블 명의 규격이 있다.  
   테이블 별칭을 사용해서 SQL 코딩을 좀 심플하게 작성  
   반드시 조인문장 작성할 때, 컬럼명 앞에 테이블 별칭을 사용해야 함  


※ 테이블 별칭을 사용하면 좋은 이점  

1. 검색속도가 빨라짐  
2. SQL유지보수가 쉬워짐. (가독성)

문제 220. 이름의 끝글자가 T로 끝나는 사원들의 이름, 월급, 부서위치, 부서명을 출력하시오

In [17]:
%%sql

select e.ename, e.sal, d.loc, d.dname
    from emp e, dept d
    where e.deptno = d.deptno
          and e.ename like '%T'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SCOTT', Decimal('3000'), 'DALLAS', 'RESEARCH')]

문제 221. 직업이 SALESMAN이고 월급이 1200 이상인 사원들의 이름, 직업, 부서위치, 월급을 출력하시오

In [18]:
%%sql

select e.ename, e.job, d.loc, e.sal
    from emp e, dept d
    where e.deptno = d.deptno
          and e.job = 'SALESMAN'
          and e.sal>= 1200

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('MARTIN', 'SALESMAN', 'CHICAGO', Decimal('1250')),
 ('ALLEN', 'SALESMAN', 'CHICAGO', Decimal('1600')),
 ('TURNER', 'SALESMAN', 'CHICAGO', Decimal('1500')),
 ('WARD', 'SALESMAN', 'CHICAGO', Decimal('1250'))]

문제 222. 부서위치, 부서위치별 토탈월급을 출력하는데 DALLAS는 제외하고 출력하시오

In [26]:
%%sql

select case grouping(d.loc) when 1 then 'Total' else d.loc end as "loc", 
       sum(e.sal) as "sal"
    from dept d, emp e
    where d.deptno = e.deptno
          and d.loc != 'DALLAS'
    group by rollup(d.loc)

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('CHICAGO', 9400), ('NEW YORK', 8750), ('Total', 18150)]

문제 223. 지금 출력된 결과를 다시 출력하는데 토탈월급이 높은 것 부터 출력하시오

In [30]:
%%sql

select case grouping(d.loc) when 1 then 'Total' else d.loc end as "loc", 
       sum(e.sal) as "sal"
    from dept d, emp e
    where d.deptno = e.deptno
          and d.loc != 'DALLAS'
    group by rollup(d.loc)
    order by sum(e.sal) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('Total', 18150), ('CHICAGO', 9400), ('NEW YORK', 8750)]

# 여러 테이블의 데이터를 조인해서 출력하기 2(NON EQUI JOIN)
"조인하려는 두개의 테이블 사이에 공통된 컬럼이 없었을 때 사용하는 조인문법"  

Ex) 이름, 월급 grade(급여등급)을 출력하시오!

In [45]:
%%sql

select e.ename, e.sal, s.grade
            from emp e, salgrade s
            where e.sal between s.losal and s.hisal

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SMITH', Decimal('800'), 1),
 ('JAMES', Decimal('950'), 1),
 ('ADAMS', Decimal('1100'), 1),
 ('WARD', Decimal('1250'), 2),
 ('MARTIN', Decimal('1250'), 2),
 ('MILLER', Decimal('1300'), 2),
 ('TURNER', Decimal('1500'), 3),
 ('ALLEN', Decimal('1600'), 3),
 ('CLARK', Decimal('2450'), 4),
 ('BLAKE', Decimal('2850'), 4),
 ('JONES', Decimal('2975'), 4),
 ('FORD', Decimal('3000'), 4),
 ('SCOTT', Decimal('3000'), 4),
 ('KING', Decimal('5000'), 5)]

문제 224. 위의 결과에서 등급이 3등급인 사원들만 출력하시오

In [47]:
%%sql

select e.ename, e.sal, s.grade
    from emp e, salgrade s
    where e.sal between s.losal and s.hisal
          and s.grade = 3

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ALLEN', Decimal('1600'), 3), ('TURNER', Decimal('1500'), 3)]

![image](https://user-images.githubusercontent.com/70187490/129708992-18c7c0f6-a68a-42db-ab73-758bbcb70911.png)

문제 255. 급여등급(grade), 급여등급별로 해당하는 사원들의 이름을 가로로 출력하시오

In [65]:
%%sql

select s.grade, listagg(e.ename, ', ') within group (order by e.ename) 이름
    from salgrade s, emp e
    where e.sal between s.losal and s.hisal
    group by s.grade

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(1, 'ADAMS, JAMES, SMITH'),
 (2, 'MARTIN, MILLER, WARD'),
 (3, 'ALLEN, TURNER'),
 (4, 'BLAKE, CLARK, FORD, JONES, SCOTT'),
 (5, 'KING')]

문제 226. 급여등급(grade), 급여등급별로 해당하는 사원들의 이름을 가로로 출력하고 월급도 옆에 같이 나오게 하시오!

In [74]:
%%sql

select s.grade, listagg(e.ename||'('||e.sal||')',', ') within group (order by e.ename) 이름
    from salgrade s, emp e
    where e.sal between s.losal and s.hisal
    group by s.grade

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(1, 'ADAMS(1100), JAMES(950), SMITH(800)'),
 (2, 'MARTIN(1250), MILLER(1300), WARD(1250)'),
 (3, 'ALLEN(1600), TURNER(1500)'),
 (4, 'BLAKE(2850), CLARK(2450), FORD(3000), JONES(2975), SCOTT(3000)'),
 (5, 'KING(5000)')]

# 여러 테이블의 데이터를 조인해서 출력하기 3(OUTER JOIN)
"조인하려는 두 테이블의 공통된 컬럼인 deptno의 데이터가 서로 일치하지 않을 때 조인하기 위해서 사용하는 조인방법"  
ex) 사원 테이블에서 부서번호를 출력하는데 중복제거해서 출력하시오

In [76]:
%%sql

select unique(deptno)
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(30,), (10,), (20,)]

Ex) 부서(dept) 테이블에서 부서번호를 출력하시오

In [78]:
%%sql

select deptno
    from dept

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10,), (20,), (30,), (40,)]

문제 227. emp와 dept를 서로 조인해서 이름, 부서위치, 부서번호를 출력하시오

In [79]:
%%sql

select e.ename, d.loc, d.deptno
    from emp e, dept d
    where e.deptno = d.deptno

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', 'NEW YORK', 10),
 ('BLAKE', 'CHICAGO', 30),
 ('CLARK', 'NEW YORK', 10),
 ('JONES', 'DALLAS', 20),
 ('MARTIN', 'CHICAGO', 30),
 ('ALLEN', 'CHICAGO', 30),
 ('TURNER', 'CHICAGO', 30),
 ('JAMES', 'CHICAGO', 30),
 ('WARD', 'CHICAGO', 30),
 ('FORD', 'DALLAS', 20),
 ('SMITH', 'DALLAS', 20),
 ('SCOTT', 'DALLAS', 20),
 ('ADAMS', 'DALLAS', 20),
 ('MILLER', 'NEW YORK', 10)]

위의 결과를 보면 dept 테이블의 40번이 출력되지 않음을 확인할 수 있다.  
이유는 사원 테이블에 40번 없기 때문이다.  
이를 출력하기 위해선 outer join 기법을 사용해야 한다.

In [80]:
%%sql

select e.ename, d.loc, d.deptno
    from emp e, dept d
    where e.deptno(+) = d.deptno

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', 'NEW YORK', 10),
 ('BLAKE', 'CHICAGO', 30),
 ('CLARK', 'NEW YORK', 10),
 ('JONES', 'DALLAS', 20),
 ('MARTIN', 'CHICAGO', 30),
 ('ALLEN', 'CHICAGO', 30),
 ('TURNER', 'CHICAGO', 30),
 ('JAMES', 'CHICAGO', 30),
 ('WARD', 'CHICAGO', 30),
 ('FORD', 'DALLAS', 20),
 ('SMITH', 'DALLAS', 20),
 ('SCOTT', 'DALLAS', 20),
 ('ADAMS', 'DALLAS', 20),
 ('MILLER', 'NEW YORK', 10),
 (None, 'BOSTON', 40)]

※   (+): Outer join sign
- outer join sign은 결과로 출력될 때 데이터가 모자란 쪽에 붙여준다.
- emp 테이블에서는 부서번호가 10, 20, 30이 었고 40번이 없다.
- dept 테이블에는 부서번호가 10, 20, 30, 40이 있다.

문제 228. 부서위치, 부서위치별 토탈월급을 출력하시오

In [88]:
%%sql

select d.loc, decode(sum(e.sal), null, 0, sum(e.sal)) as "Total sal"
    from dept d, emp e
    where e.deptno(+) = d.deptno 
    group by d.loc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('NEW YORK', 8750), ('DALLAS', 10875), ('CHICAGO', 9400), ('BOSTON', 0)]

문제 230. 우리반 테이블과 telecom_price 테이블을 조인해서  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
이름, 나이, 성별, 통신사, 통신사 기본요금(price)을 출력하는데  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
나이가 27 이상인 학생들만 출력되게 하시오

In [111]:
%%sql

select replace(e.ename, 
               substr(e.ename, 
                              case when length(e.ename)=4 then 3 else 2 end, 1)
                                                                               ,'*') as name,
       substr(e.age, 1, 1)||'*' as age,
       e.gender, 
       e.telecom,
       t.price
        
    from telecom_price t, emp12 e
    where t.telecom = e.telecom 
          and e.age >= 27

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('남궁*미', '2*', '여', 'kt', 17000),
 ('이*혁', '2*', '남', 'kt', 17000),
 ('한*', '3*', '남', 'kt', 17000),
 ('현*연', '3*', '여', 'sk', 18500),
 ('성*창', '2*', '남', 'sk', 18500),
 ('유*영', '2*', '여', 'sk', 18500),
 ('김*민', '2*', '남', 'lg', 18000),
 ('김*원', '2*', '여', 'kt', 17000),
 ('김*승', '2*', '여', 'lg', 18000),
 ('김*린', '2*', '여', 'kt', 17000),
 ('신*종', '2*', '남', 'lg', 18000),
 ('김*순', '3*', '남', 'sk', 18500),
 ('허*민', '3*', '여', 'sk', 18500),
 ('이*성', '2*', '남', 'sk', 18500),
 ('황*현', '2*', '여', 'kt', 17000),
 ('권*환', '2*', '남', 'kt', 17000),
 ('송*미', '2*', '여', 'kt', 17000),
 ('김*라', '2*', '여', 'kt', 17000),
 ('권*원', '3*', '남', 'sk', 18500),
 ('김*원', '4*', '여', 'lg', 18000)]

# 여러 테이블의 데이터를 조인해서 출력하기 4(SELF JOIN)
"자기 자신의 테이블과 조인하는 조인 문법"  
※ 자기 자신의 테이블과 조인을 하는 이유  
    -> 사원 테이블에서 사원이름과 그 사원을 관리하는 관리자의 이름을 하나의 결과로 볼 수 있기 때문